<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#crosstab" data-toc-modified-id="crosstab-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>crosstab</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat:-two-things-together" data-toc-modified-id="Concat:-two-things-together-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Concat: two things together</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge:-related-columns" data-toc-modified-id="Merge:-related-columns-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Merge: related columns</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-&amp;-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-&amp;-Concatenating-in-two-different-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merging &amp; Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join:-relating-index" data-toc-modified-id="Join:-relating-index-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Join: relating index</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://miro.medium.com/max/1400/1*6d5dw6dPhy4vBp2vRW6uzw.webp)

In [99]:
import pandas as pd
import numpy as np

In [100]:
# One table: group info by category, and check how much of something
    # organic -> average price
    # conventional -> average price
    
# groupby -> pivot table (excel)
# GROUPING based on CATEGORICAL VARIABLE
# To get a measure (a qtve variable) on each level of the category

# avg price (measure) per type of avocado (categorical)

## Data aggregation

`groupby, pivot table & cross_tab`

### groupby
Pandas GroupBy is a powerful and versatile function in Python. It allows us to split your data into separate groups to perform calculations for better analysis.
A DataFrame can be grouped on its rows (axis=0) or on its columns (axis=1). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object. The shape of the resulting object will usually depend on what is done with the data.

`df[subset].groupby(category).aggregation()`

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [101]:
df = pd.read_csv("../datasets/employees.csv")
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

In [102]:
# Explore
    # info
   # describe 
    # shape
    # WITHIN COLUMNS
        # missing values
        # how many of each? -> value_counts() 
        # unique()
    # mean, min, max

`groupby the departments and their mean age`

In [103]:
# mean AGE per DEPARTMENT?
df.groupby("Department").aggregate({"Age":"mean"})

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`groupby the departments and their maximum age`

In [104]:
df.groupby("Department").aggregate({"Age":"max"})

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`groupby the departments and their min age`

In [105]:
df.groupby("Department").aggregate({"Age":"min"})

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`groupby: 2+`: Different Education Fields and their Mean Salaries in each of the Department

In [106]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [107]:
df["EducationField"].unique()

array(['Life Sciences', 'Other', 'Medical', 'Marketing',
       'Technical Degree', 'Human Resources'], dtype=object)

In [108]:
df.columns = [i.lower().replace(" ", "") for i in df.columns]

In [109]:
df.sample()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager
420,29,No,Travel_Rarely,986,Research & Development,3,4,Medical,1,564,...,3,80,0,10,2,3,10,2,0,7

In [110]:
df["monthlyincome"].mean()

6502.931292517007

In [111]:
type(df_new)

pandas.core.frame.DataFrame

In [112]:
df_new["monthlyincome"]["mean"]

department              educationfield
Human Resources         Human Resources     7241.148148
                        Life Sciences       6914.062500
                        Medical             6594.076923
                        Other               5016.666667
                        Technical Degree    3081.250000
Research & Development  Life Sciences       6179.984091
                        Medical             6539.223140
                        Other               6278.687500
                        Technical Degree    5760.819149
Sales                   Life Sciences       7246.233333
                        Marketing           7348.584906
                        Medical             6377.227273
                        Other               5398.733333
                        Technical Degree    6066.294118
Name: mean, dtype: float64

In [113]:
df_new["monthlyincome"]["new_col"] =  df_new["monthlyincome"]["mean"] * 100

/var/folders/pz/11hk3xjx34z9gw2tjzmjl4lm0000gn/T/ipykernel_30189/2516271992.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new["monthlyincome"]["new_col"] =  df_new["monthlyincome"]["mean"] * 100

In [114]:
df_new = df.groupby(["department", "educationfield"]).aggregate({"monthlyincome":["mean", "min", "max", "count"]})
df_new

                                        monthlyincome
                                                 mean   min    max count
department             educationfield
Human Resources        Human Resources    7241.148148  1555  19636    27
                       Life Sciences      6914.062500  2064  19717    16
                       Medical            6594.076923  2109  18200    13
                       Other              5016.666667  2991   7988     3
                       Technical Degree   3081.250000  2564   4323     4
Research & Development Life Sciences      6179.984091  1051  19999   440
                       Medical            6539.223140  1009  19859   363
                       Other              6278.687500  1951  19613    64
                       Technical Degree   5760.819149  1274  19943    94
Sales                  Life Sciences      7246.233333  1118  19847   150
                       Marketing          7348.584906  1675  19845   159
                       Medical            6377.227273  1052  19833    88
                       Other              5398.733333  2121  10932    15
                       Technical Degree   6066.294118  1091  16872    34

In [115]:
df_new["monthlyincome"]["new_col"] =  df_new["monthlyincome"]["mean"] * 100

/var/folders/pz/11hk3xjx34z9gw2tjzmjl4lm0000gn/T/ipykernel_30189/2516271992.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new["monthlyincome"]["new_col"] =  df_new["monthlyincome"]["mean"] * 100

In [116]:
# TO DO!!!: HOW TO ALSO INCLUDE A NEW COLUMN THAT IS THE TOTAL FOR THE SUBTOTALS GOTTEN BEFORE

In [117]:
df_new.index

MultiIndex([(       'Human Resources',  'Human Resources'),
            (       'Human Resources',    'Life Sciences'),
            (       'Human Resources',          'Medical'),
            (       'Human Resources',            'Other'),
            (       'Human Resources', 'Technical Degree'),
            ('Research & Development',    'Life Sciences'),
            ('Research & Development',          'Medical'),
            ('Research & Development',            'Other'),
            ('Research & Development', 'Technical Degree'),
            (                 'Sales',    'Life Sciences'),
            (                 'Sales',        'Marketing'),
            (                 'Sales',          'Medical'),
            (                 'Sales',            'Other'),
            (                 'Sales', 'Technical Degree')],
           names=['department', 'educationfield'])

In [118]:
# multiindex: https://pandas.pydata.org/docs/user_guide/advanced.html

`more fields`

#### groupby & aggregate

Another way to groupby with agg syntax
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

- mean
- sum
-count

Suppose we want to calculate the mean of column data1 using the labels of key1. There are several ways to do it. One is to access data1 and call groupby with the column (a String) in key1.
The data (a Series) has been aggregated based on the group key, producing a new String that is now indexed by the unique values ​​of the key1 column. The resulting index has the name 'key1' because the DataFrame column `df['key1']` did.

In [119]:
# mean
# sum
# count
# min
# max
# stdeviation

In [120]:
# education field, hourly rate, department, stardar hours, age

In [121]:
df.groupby("age").aggregate({"monthlyincome":"mean"}) # average salary per age

# age: 
    # 18-19 , 21, 22
    # 18.5
    # 18.6
    
# create groups or changes
    # create new column: apply(lambda x: ....)
    # group by the categories and aggregate based on mean of income

     monthlyincome
age
18     1518.375000
19     2075.000000
20     2539.363636
21     2491.461538
22     2950.000000
23     2515.357143
24     3243.923077
25     4144.769231
26     3531.487179
27     4190.416667
28     3904.833333
29     4584.411765
30     4814.850000
31     5525.391304
32     5092.459016
33     5500.500000
34     5269.220779
35     5425.282051
36     5590.913043
37     5853.860000
38     5721.586207
39     8183.357143
40     7700.947368
41     8379.825000
42     8074.847826
43     8444.937500
44     7114.333333
45     7811.219512
46    11457.969697
47     8931.416667
48     9344.789474
49     9952.875000
50    12697.166667
51     9632.473684
52    10606.888889
53    11564.157895
54    10875.833333
55    13204.181818
56     8248.357143
57     8803.000000
58    10705.785714
59     8038.100000
60    10268.000000

In [122]:
# education field, hourly rate, department, stardar hours, age

In [123]:
df["standardhours"].value_counts()

standardhours
80    1470
Name: count, dtype: int64

In [124]:
# Q: prefixes in the columns?
# TO-DO: documentation

In [126]:
df.groupby(["department", "educationfield"]).aggregate({"hourlyrate":"mean", "standardhours":"mean", "age":"mean" })

                                         hourlyrate  standardhours        age
department             educationfield
Human Resources        Human Resources    60.888889           80.0  37.037037
                       Life Sciences      61.625000           80.0  39.375000
                       Medical            72.076923           80.0  39.846154
                       Other              76.000000           80.0  34.666667
                       Technical Degree   64.000000           80.0  32.500000
Research & Development Life Sciences      66.570455           80.0  36.997727
                       Medical            66.330579           80.0  37.242424
                       Other              62.203125           80.0  36.187500
                       Technical Degree   66.351064           80.0  37.063830
Sales                  Life Sciences      68.153333           80.0  37.186667
                       Marketing          66.150943           80.0  37.924528
                       Medical            59.943182           80.0  34.727273
                       Other              60.333333           80.0  32.000000
                       Technical Degree   67.676471           80.0  33.941176

### Pivot Tables

[groupby vs pivot table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b?source=userActivityShare-4c6d9a33c6-1674605913&_branch_match_id=1146490620103499300&_branch_referrer=H4sIAAAAAAAAA8soKSkottLXz8nMy9bLTU3JLM3VS87P1TfKCvCtKvOvCCpPAgAN4ht%2FIwAAAA%3D%3D)

```pivot_table(df, values=None, index=None, columns=None, aggfunc='mean', ...)```

* We can create a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

`pivot table`: the department and their mean ages

`pivot table`: the department and their max ages

`pivot table`: the department and their min ages

`pivot table`: the department and their median age

`multi-index pivot table`: Department and Education Field and check the maximum salary values of employees

### Differences between pivot table and groupby function

`groupby`: team mean age by team abbreviation & season.

`pivot_table`: team mean age by team abbreviation & season.

### crosstab

* Compute a simple cross tabulation of two (or more) factors. By default computes a frequency table of the factors unless an array of values and an aggregation function are passed. Usually used to see the frequency of two qualitative variables: how many times the value of one column happens in the other one

```pd.crosstab(df[column1], df[column2])```

In [72]:
pd.crosstab(df["department"], df["educationfield"]) # default is the count

educationfield,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
department,,,,,,
Human Resources,27,16,0,13,3,4
Research & Development,0,440,0,363,64,94
Sales,0,150,159,88,15,34

In [73]:
pd.crosstab(df["department"], df["educationfield"], df["monthlyincome"], aggfunc="mean") 
# same as previous pivot table / groupby
# df.groupby(["department", "educationfield"]).aggregate({"monthlyincome":"mean"})

educationfield,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
department,,,,,,
Human Resources,7241.148148,6914.062500,NaN,6594.076923,5016.666667,3081.250000
Research & Development,NaN,6179.984091,NaN,6539.223140,6278.687500,5760.819149
Sales,NaN,7246.233333,7348.584906,6377.227273,5398.733333,6066.294118

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Data combination: mixing dataframes

- https://realpython.com/pandas-merge-join-and-concat/
- https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

### Concat: two things together
We join dataframes along axis 0 one below the other. Align columns by label.

In [74]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')
df.sample()

         age gender occupation zip_code
user_id
575       33      M  marketing    46032

In [75]:
# Concatenate dataframes: put them together
#  5 rows + 10 more rows
# side to side

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

#### Concatenating on axis 0 (rows)

In [76]:
df_1 = df.sample(frac=0.1)

In [77]:
df.sample()

         age gender occupation zip_code
user_id
183       33      M  scientist    27708

In [78]:
df_1.shape

(94, 4)

#### Concatenating on axis 1 (columns)

In [79]:
df_2 = df.sample(frac=0.2)
print(df_2.shape)
df_2

(189, 4)

         age gender  occupation zip_code
user_id
94        26      M     student    71457
700       17      M     student    76309
47        53      M   marketing    07102
805       27      F       other    20009
411       34      M    educator    44691
...      ...    ...         ...      ...
622       25      M  programmer    14850
714       26      M    engineer    55343
780       49      M  programmer    94560
573       68      M     retired    48911
541       19      F     student    84302

[189 rows x 4 columns]

In [80]:
concatenated_dataframe = pd.concat([df_1, df_2], axis=0)
concatenated_dataframe

         age gender  occupation zip_code
user_id
549       42      M   scientist    45680
351       61      M    educator    49938
804       39      M    educator    61820
738       35      M  technician    95403
790       27      M  technician    80913
...      ...    ...         ...      ...
622       25      M  programmer    14850
714       26      M    engineer    55343
780       49      M  programmer    94560
573       68      M     retired    48911
541       19      F     student    84302

[283 rows x 4 columns]

In [81]:
concatenated_dataframe.shape

(283, 4)

In [82]:
concatenated_dataframe_axis_1 = pd.concat([df_1, df_2], axis=1)
concatenated_dataframe_axis_1 #diagonal df on NaN

          age gender  occupation zip_code   age gender  occupation zip_code
user_id
549      42.0      M   scientist    45680   NaN    NaN         NaN      NaN
351      61.0      M    educator    49938   NaN    NaN         NaN      NaN
804      39.0      M    educator    61820   NaN    NaN         NaN      NaN
738      35.0      M  technician    95403   NaN    NaN         NaN      NaN
790      27.0      M  technician    80913   NaN    NaN         NaN      NaN
...       ...    ...         ...      ...   ...    ...         ...      ...
622       NaN    NaN         NaN      NaN  25.0      M  programmer    14850
714       NaN    NaN         NaN      NaN  26.0      M    engineer    55343
780       NaN    NaN         NaN      NaN  49.0      M  programmer    94560
573       NaN    NaN         NaN      NaN  68.0      M     retired    48911
541       NaN    NaN         NaN      NaN  19.0      F     student    84302

[261 rows x 8 columns]

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge: related columns

[Merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) is most useful when you want to merge rows that share data.

In [83]:
from IPython.display import display_html

In [84]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [85]:
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [88]:
# merge, default is inner

result = pd.merge(df1, df2)
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

#### LEFT Merge

In [89]:
left_merge = pd.merge(df1, df2, how="left")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
left_merge = left_merge.style.set_table_attributes("style='display:inline'").set_caption("left_merge")

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [90]:
display_html(left_merge._repr_html_(), raw=True)

,key1,key2,A,B,C,D
0,K0,K0,A0,B0,C0,D0
1,K0,K1,A1,B1,nan,nan
2,K1,K0,A2,B2,C1,D1
3,K1,K0,A2,B2,C2,D2
4,K2,K1,A3,B3,nan,nan

#### RIGHT Merge

In [ ]:
right_merge = pd.merge(df1, df2, how="right")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
right_merge = right_merge.style.set_table_attributes("style='display:inline'").set_caption("right_merge")

display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(),raw=True)

In [ ]:
display_html(right_merge._repr_html_(), raw=True)

#### INNER Merge

In [ ]:
inner_merge = pd.merge(df1, df2, how="inner")


df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
inner_merge = inner_merge.style.set_table_attributes("style='display:inline'").set_caption("inner_merge")

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

In [ ]:
display_html(inner_merge._repr_html_(), raw=True)

#### OUTER Merge

In [ ]:
outer_merge = pd.merge(df1, df2, how="outer")

df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
outer_merge = outer_merge.style.set_table_attributes("style='display:inline'").set_caption("outer_merge")

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

In [ ]:
display_html(outer_merge._repr_html_(), raw=True)

### Merging & Concatenating in two different columns

In [ ]:
df1_docs = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2_docs = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [ ]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

#### Concatenating in two different columns

In [ ]:
concat_docs = pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = concat_docs.style.set_table_attributes("style='display:inline'").set_caption('concat_docs')

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

In [ ]:
display_html(merge_styler._repr_html_(), raw=True)

#### Merging in two different columns

In [ ]:
df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_() +  " " + df2_styler._repr_html_(), raw=True)

In [ ]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_fromleft", "_fromright"])

In [ ]:
merge_docs = df1_docs.merge(df2_docs, left_on='lkey', right_on='rkey', suffixes = ["_from_left", "_from_right"])


df1_styler = df1_docs.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2_docs.style.set_table_attributes("style='display:inline'").set_caption('Right table')
merge_styler = merge_docs.style.set_table_attributes("style='display:inline'").set_caption('merge_docs')

display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

In [ ]:
display_html(merge_styler._repr_html_(), raw=True)

In [ ]:
# suffixes: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [ ]:
# concat: putting things together
# join/merge: putting things together THAT ARE RELATED
    # related info in the same place -> reduces redundancy

### Join: relating index
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [91]:
# PANDAS
    # MERGE IN PANDAS: targeting COLUMNS to put columns together
    # JOIN IN PANDAS: putting things together based on the INDEX


# MYSQL: join (cols)

In [92]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [93]:
left_df = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right_df = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [94]:
df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

,A,B
K0,A0,B0
K1,A1,B1
K2,A2,B2
,C,D
K0,C0,D0
K2,C2,D2
K3,C3,D3

In [96]:
result = left_df.join(right_df, how="left")

#Rendering the df's in the same line. No need to learn this code

df1_styler = left_df.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = right_df.style.set_table_attributes("style='display:inline'").set_caption('Right table')
df1_df2_merged = result.style.set_table_attributes("style='display:inline'").set_caption('JOIN')

display_html(df1_styler._repr_html_()+ df2_styler._repr_html_() + df1_df2_merged._repr_html_(), raw=True)
#display_html(df1_styler._repr_html_()+ df2_styler._repr_html_(), raw=True)

### Differences between join & merge

<figure class="wp-block-table is-style-stripes"><table class="has-fixed-layout"><thead><tr><th><strong>Join Feature</strong></th><th class="has-text-align-center" data-align="center"><strong>join()</strong></th><th class="has-text-align-center" data-align="center"><strong>merge()</strong></th></tr></thead><tbody><tr><td>inner</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>left</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>right</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>outer</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>cross</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Indices</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Join on Columns</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on column, right on index</td><td class="has-text-align-center" data-align="center">Yes</td><td class="has-text-align-center" data-align="center">Yes</td></tr><tr><td>Left on index, right on column</td><td class="has-text-align-center" data-align="center">X</td><td class="has-text-align-center" data-align="center">Yes</td></tr></tbody></table>

In [127]:
# PUTTING THINGS TOGETHER
    # Concat
        # phisically putting things side by side
        # up-down: axis=0
        # left& right (diagonal of nan): axis=1
    # Merge
        # based on: common keys/COLS
    # Join
        # based on: common index
        
    # Inner, left & right
        # left vs right?: 
        # inner: you want no missing values

# Pivot tables-groupbys / crosstabs
    # GOAL
    # Grouping by categorical to aggregate on qtve
        # count on categorical (aggregate on categorical if you count), the rows, not the values
        
# When grouping: from less to more categories (readability)

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)